app/Http/Controllers/CustomerController.php

select * from `customer` where `customer`.`id` in (70)
---
    public function update(Request $request, Customer $customer)
    {
        $validated = $request->validate([
            'name' => 'required|max:255',
            'address' => 'required',
            'phone' => 'required|numeric|unique:customer,phone,' . $customer->id,
            'city' => 'required',
        ]);

        if ($validated) {
            $customer->name = $request->name;
            $customer->address = $request->address;
            $customer->phone = $request->phone;
            $customer->city = $request->city;
            $customer->status = 'AC';
            $customer->save();
            return redirect()->route('customer.edit', $customer->id)->with('message', $customer->name . ' Sukses di ubah');