app/Http/Controllers/CustomerController.php

select * from `customer` where `status` = 'AC' and `name` LIKE '%a%' or `id` = '$a'
---
    public function indexJson(Request $request)
    {

        $customer = Customer::whereStatus('AC')
            ->where("name", "LIKE", "%{$request->input('query')}%")->latest()->limit(5)->get();

select count(*) as aggregate from `customer` where `status` = 'AC'
select * from `customer` where `status` = 'AC' order by `created_at` desc limit 15 offset 0
---
    public function index(Request $request)
    {
        $query = Customer::query();

        $query->when($request->filled('startdate'), function ($query) {
            $query->where('created_at', '>', request('startdate'));
        });

        $query->when($request->filled('enddate'), function ($query) {
            $query->where('created_at', '<', request('enddate'));
        });

        $customer = $query->whereStatus('AC')->latest()->paginate(15);

        return view('customer.index')->with('customer', $customer);